# WrongFabricSheetSpacing Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricFailures..::..WrongFabricSheetSpacing Property
BuiltInFailures..::..FabricFailures Class See Also
---
Wrong Spacing of the Fabric Sheet Type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WrongFabricSheetSpacing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WrongFabricSheetSpacing As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WrongFabricSheetSpacing {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FabricFailures Class
Autodesk.Revit.DB Namespace